---
kind: method
id: M:Autodesk.Revit.DB.FailureDefinitionAccessor.GetApplicableResolutionTypes
source: html/6bcfac3c-c20f-b3b4-cacc-917f9691ab72.htm
---
# Autodesk.Revit.DB.FailureDefinitionAccessor.GetApplicableResolutionTypes Method

Retrieves a list of resolution types applicable to the failure.

## Syntax (C#)
```csharp
public IList<FailureResolutionType> GetApplicableResolutionTypes()
```

## Returns
The list of resolution types applicable to the failure.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The FailureDefinitionAccessor has not been properly initialized.